[
    {
       "﻿Name": "Burst Bomb",
       "Image": "images/subs/Wsb_Bomb_Quick.png",
       "Alt Text": "Burst Bomb",
       "Description": "Burst Bombs are spherical balloons filled with ink that explode on contact. They use less ink than Splat Bombs, and Suction Bombs, and therefore cause less damage.",
       "Min Splash Damage": 25,
       "Damage On Contact": 35,
       "Direct Hit Damage": 60,
       "Ink Consumption": 40
    },
    {
       "﻿Name": "Curling Bomb",
       "Image": "images/subs/Wsb_Bomb_Curling.png",
       "Alt Text": "Curling Bomb",
       "Description": "When deployed, the Curling Bomb travels in a straight line across the floor, leaving a trail of Ink and bouncing off of any wall or obstacle it encounters. It explodes after it has traveled its maximum distance. The maximum distance of the Curling Bomb may be shortened by charging, or 'cooking' it with R before release.",
       "Min Splash Damage": 30,
       "Direct Hit Damage": 150,
       "Ink Consumption": 70
    },
    {
       "﻿Name": "Autobomb",
       "Image": "images/subs/Wsb_Bomb_Robo.png",
       "Alt Text": "Autobomb",
       "Description": "Autobombs are comparable to S Weapon Sub Seekers from Splatoon. Unlike the Seeker however, they do not leave a trail of ink and can freely change direction. Once thrown, the Autobomb will seek out any enemy players in the vicinity, indicated by the circle which appears once the autobomb has landed, and will automatically move towards them for quite a long time. Once the Autobomb reaches a player or travels far enough without reaching the player, it will explode. If thrown and no enemies are in range, the Autobomb will automatically explode where it was thrown, similar to a S2 Weapon Sub Splat Bomb.",
       "Min Splash Damage": 30,
       "Direct Hit Damage": 150,
       "Ink Consumption": 70
    },
    {
       "﻿Name": "Splat Bomb",
       "Image": "images/subs/Wsb_Bomb_Splash.png",
       "Alt Text": "Splat Bomb",
       "Description": "When thrown, a second after touching a surface, the Splat Bomb explodes and coats the area in its respective team's color. Splat Bombs will not explode in mid-air; they can only explode after touching an object.",
       "Min Splash Damage": 30,
       "Direct Hit Damage": 180,
       "Ink Consumption": 70,
       "Explosion": 1,
       "Explosion Modifier": "after contact"
    },
    {
       "﻿Name": "Suction Bomb",
       "Image": "images/subs/Wsb_Bomb_Suction.png",
       "Alt Text": "Suction Bomb",
       "Description": "Suction Bombs can be thrown and are able to attach to virtually any surface, including walls and ceilings. After two seconds, they explode in a burst of ink. Throwing a Suction Bomb will use up 70% of player's Ink Tank under normal circumstances, just like the Splat Bomb. They will also immediately explode upon contact with the Rainmaker's shield or a Splash Wall.",
       "Min Splash Damage": 30,
       "Direct Hit Damage": 180,
       "Ink Consumption": 70,
       "Explosion": 2,
       "Explosion Modifier": "after deployed"
    },
    {
       "﻿Name": "Squid Beakon",
       "Image": "images/subs/Wsb_Flag.png",
       "Alt Text": "Squid Beakon",
       "Description": "Squid Beakons are small devices placed at the user's feet that can be Super Jumped to by allies. A Beakon is destroyed when the Super Jumping Inkling lands or when it is damaged by an enemy. One Inkling using Beakons can have up to three placed in the stage at one time; attempting to create a fourth will destroy the oldest of those currently active.",
       "Ink Consumption": 75
    },
    {
       "﻿Name": "Point Sensor",
       "Image": "images/subs/Wsb_PointSensor.png",
       "Alt Text": "Point Sensor",
       "Description": "Point Sensors are black, cube-like objects with cylinder-shaped protrusions that change color depending on the player's Ink. When thrown, they explode in a spherical cloud that has the color of the player's ink and tag any enemy Inkling in a certain range with a swirling squid marker. This marker allows tagged enemies to be seen through barriers by all teammates, allowing them to be easily tracked.",
       "Base Duration": 8,
       "Base Duration Modifier": "upon contact",
       "Ink Consumption": 60
    },
    {
       "﻿Name": "Toxic Mist",
       "Image": "images/subs/Wsb_PoisonFog.png",
       "Alt Text": "Toxic Mist",
       "Description": "When thrown, Toxic Mist surrounds a circular area in fog. Opponents caught in the fog move more slowly and gradually lose ink. Players that stay in the fog for a longer period of time are more severely affected.",
       "Base Duration": 7,
       "Base Duration Modifier": "after deployed",
       "Ink Consumption": 70
    },
    {
       "﻿Name": "Splash Wall",
       "Image": "images/subs/Wsb_Shield.png",
       "Alt Text": "Splash Wall",
       "Description": "The Splash Wall forms a temporary barrier of falling ink, preventing enemy fire from passing through. Opponents will instantly get splattered if they attempt to walk through the Splash Wall, but the player who spawned it and their teammates will have no effect. These players will also be able to shoot through the wall. A similar weapon is also used by the Octarians in Octo Valley.",
       "Base Damage": 50,
       "Base Damage Modifier": "per frame",
       "Base Duration": 7,
       "Base Duration Modifier": "when not damaged",
       "Ink Consumption": 60
    },
    {
       "﻿Name": "Sprinkler",
       "Image": "images/subs/Wsb_Sprinkler.png",
       "Alt Text": "Sprinkler",
       "Description": "The Sprinkler was tweaked in Splatoon 2 to have its inking power start out stronger but weaken over time. There are four distinct phases: Deployment, High-power, Mid-power, and Low-power.",
       "Base Damage": 20,
       "Base Duration": "placeholder",
       "Ink Consumption": 70
    },
    {
       "﻿Name": "Ink Mine",
       "Image": "images/subs/Wsb_TimerTrap.png",
       "Alt Text": "Ink Mine",
       "Description": "Up to two Ink Mines can now be placed at once, and if anyone hit by a mine survives their position will be temporarily marked as if they were exposed to a Point Sensor. Ink Mines do not detonate on their own, so they will remain on the battlefield until triggered. Each Ink Mine uses 60% of the ink tank's capacity. It deals 35 damage to opponents caught directly in the blast, and 20 damage to those near the blast.",
       "Base Damage": 35,
       "Min Splash Damage": 20,
       "Ink Consumption": 60
    }
 ]